# List and Dataframe in Python | BAIS 6100

**Instructor: Qihang Lin**

## Dataframe and Pandas

Pandas is a fundamental package that offers data structures and operations for manipulating numerical tables and time series.

In [1]:
import pandas as pd

Pandas provide two different data structures:
- A <b>series</b> is a one-dimensional array. A series has an index array, which is called just index.
- A <b>dataframe</b> is a two-dimensional data table. A dataframe has two index arrays: row index and column name. 
- Each column is essentially a series.

In [2]:
df = pd.read_csv('classdata/clinton-street-social-club.csv', encoding="latin-1")

We read the csv file into a <b>dataframe</b>. In this example, encoding scheme "latin-1" is needed to load this file successfully.

<b>Three things</b> you may want to do first after creating a dataframe:

1. Look at the top five rows.

In [3]:
df.head()

                                             reviews  ratings
0  With its jazzy vibes and chill atmosphere, Cli...        5
1  This was an exceptional surprise in Iowa city!...        5
2  There is no other place in town like CSSC. If ...        5
3  Tucked away through a narrow staircase like a ...        5
4  Love. Love. Love. If you're older than the col...        5

2. Check the dimension (how many rows and colmns)

In [4]:
df.shape

(132, 2)

Note that the array 0,1,2,3... in the dataframe here is the row index array and is not considered as a column of the dataframe. In general, row index does not need to be a continuous sequence of integers and does not need to be numeric.

3. Show the columns' names

In [5]:
df.columns

Index(['reviews', 'ratings'], dtype='object')

## Select Elements from a Dataframe

In Python, the index of element in an array starts with 0 rather than 1.  

A syntax like <b>a:b</b> represent a range of indexes that starts from <b>a</b> and ends at <b>b-1</b> (b is not included).

In [6]:
df[0:5]                 # Returns the rows 0 to 4.

                                             reviews  ratings
0  With its jazzy vibes and chill atmosphere, Cli...        5
1  This was an exceptional surprise in Iowa city!...        5
2  There is no other place in town like CSSC. If ...        5
3  Tucked away through a narrow staircase like a ...        5
4  Love. Love. Love. If you're older than the col...        5

In [7]:
df["ratings"]        # Returns all rows under the column ratings.

0      5
1      5
2      5
3      5
4      5
      ..
127    2
128    4
129    2
130    5
131    2
Name: ratings, Length: 132, dtype: int64

In [8]:
df[["reviews", "ratings"]]     # Show multiple columns at a time

                                               reviews  ratings
0    With its jazzy vibes and chill atmosphere, Cli...        5
1    This was an exceptional surprise in Iowa city!...        5
2    There is no other place in town like CSSC. If ...        5
3    Tucked away through a narrow staircase like a ...        5
4    Love. Love. Love. If you're older than the col...        5
..                                                 ...      ...
127  The food was not good and service was not frie...        2
128  Wow have times changed in downtown Iowa City. ...        4
129  Great building. Loved the big windows overlook...        2
130  Love the food, love the service. If you are in...        5
131  Dinner and cocktails on a Friday night. Place ...        2

[132 rows x 2 columns]

To select all rows under certain columns, put a list of column names as a filtering condition.

In [9]:
df.ratings      # Returns all rows under the column ratings.

0      5
1      5
2      5
3      5
4      5
      ..
127    2
128    4
129    2
130    5
131    2
Name: ratings, Length: 132, dtype: int64

In [10]:
df["reviews"][4]       # Returns the 5th element under the column reviews.

"Love. Love. Love. If you're older than the college population, this is your place, my friends. I love the vibe here. It's darkened, has an older population of young adults here. There's candles! There's such good food. And the cocktails? AMAZINGZ. I had the best Tom Collins I've ever had here. Well worth the money and the stop by. \r\n\r\nI highly recommend swinging by for small plates. I had the poutine (fries with gravy and cheeeese) and then also the cheese curds with ranch (deliciously light). \r\n\r\nGo go go! You'll love. \r\n\r\nWhat to try: Annabel Lee cocktail \r\n\r\nWater rating: 9/10"

Note that you should look up the column label first, followed by the row index number, each in separate matching brackets.

In [11]:
df["ratings"][0:3]          # Returns the first 3 rows under the column ratings.

0    5
1    5
2    5
Name: ratings, dtype: int64

<b>iloc</b> means (numeric) index location. If there is only one argument inside the matching square brackets, the only argument is for the row index rather than the column index.

In [12]:
df.iloc[0]             # Returns the first row.

reviews    With its jazzy vibes and chill atmosphere, Cli...
ratings                                                    5
Name: 0, dtype: object

If there are two arguments inside the matching square brackets, the first one is for the row index while the second for the column index. Note that when using <b>iloc</b> you should look up the row index numbers first and then the column index numbers, all in matching square brackets.

In [13]:
df.iloc[:, 0]          # Returns all rows under the first column.

0      With its jazzy vibes and chill atmosphere, Cli...
1      This was an exceptional surprise in Iowa city!...
2      There is no other place in town like CSSC. If ...
3      Tucked away through a narrow staircase like a ...
4      Love. Love. Love. If you're older than the col...
                             ...
127    The food was not good and service was not frie...
128    Wow have times changed in downtown Iowa City. ...
129    Great building. Loved the big windows overlook...
130    Love the food, love the service. If you are in...
131    Dinner and cocktails on a Friday night. Place ...
Name: reviews, Length: 132, dtype: object

In [14]:
df.iloc[0:3, 0:2]        # Returns the first 3 rows under the first 2 columns.

                                             reviews  ratings
0  With its jazzy vibes and chill atmosphere, Cli...        5
1  This was an exceptional surprise in Iowa city!...        5
2  There is no other place in town like CSSC. If ...        5

<b>loc</b> means location by names. Similar to <b>iloc</b> but require textual argument if available (e.g., columns names rather than column IDs).

In [15]:
rowid = [3, 5, 7]
columnid = ["ratings","ratings","reviews"]
df.loc[rowid, columnid]

   ratings  ratings                                            reviews
3        5        5  Tucked away through a narrow staircase like a ...
5        5        5  All I can say is.....WOW!!!  Just go here and ...
7        5        5  Fantastic. Feels like you are stepping back in...

<i>rowid</i> and <i>columnid</i> created above are <b>list</b>s, which is another structure for one-dimensional data.

## Create a Copy of Dataframe

In the case you want to extract a sub-dataframe from the original one and continue working from there, it is recommended you create a copy using **.copy**.

In [16]:
dftemp = df.loc[rowid, columnid].copy()
dftemp

   ratings  ratings                                            reviews
3        5        5  Tucked away through a narrow staircase like a ...
5        5        5  All I can say is.....WOW!!!  Just go here and ...
7        5        5  Fantastic. Feels like you are stepping back in...

It is not recommended to use <b>dftemp = df.loc[rowid, columnid]</b>. This is because dftemp created without .copy() is not really an independent copy, meaning that any changes you make on dftemp will also happen on the original dataframe df.

## Add and Delete Columns

Here, we add a new column called review_length. We apply len() to each element in column reviews to measure the number of charaters in each review.

In [17]:
df["review_length"] = [len(s) for s in df["reviews"]]
df.head(5)

                                             reviews  ratings  review_length
0  With its jazzy vibes and chill atmosphere, Cli...        5            967
1  This was an exceptional surprise in Iowa city!...        5            387
2  There is no other place in town like CSSC. If ...        5            733
3  Tucked away through a narrow staircase like a ...        5            606
4  Love. Love. Love. If you're older than the col...        5            586

The <b>drop</b> method is used to delete columns or rows.

In [18]:
df.drop("review_length", axis=1, inplace=True)   
df.head()

                                             reviews  ratings
0  With its jazzy vibes and chill atmosphere, Cli...        5
1  This was an exceptional surprise in Iowa city!...        5
2  There is no other place in town like CSSC. If ...        5
3  Tucked away through a narrow staircase like a ...        5
4  Love. Love. Love. If you're older than the col...        5

We need to set axis=1 so the method can find the column called "review_length". If axis=0, the method will find the row whose index is "review_length" (and such a row index does not exist).

Here, <b>inplace=True</b> is needed to make sure the change happens in the original dataframe. Otherwise, <b>drop</b> will return a new copy of dataframe but not change the original one.

## Categorical column

For a categorical column such as ratings (it can be treated as a numeric column as well), two things you can do to summarize it:

1. List all unique values and count them.

In [19]:
df["ratings"].unique()

array([5, 4, 2, 1, 3])

In [20]:
len(df["ratings"].unique())

5

2. Get the frequency of each unique value

In [21]:
df["ratings"].value_counts()

5    77
4    33
2     8
3     8
1     6
Name: ratings, dtype: int64

## Selecting Rows using Boolean Expression

In [22]:
df[df.ratings < 4]        # Sets a condition for filtering.

                                               reviews  ratings
13   Two stars. Go for the cocktails. The cheese cu...        2
28   My husband and I used to live in Iowa City but...        1
35   Atmosphere is nice, although they may be tryin...        3
56   Pros:\r\n1. Excellent atmosphere that is unlik...        3
59   It's the fourth time we come here. Usually the...        2
66   Unique menu items and a classy ambience. I wil...        3
68   Decent place, they have a great view of the ca...        3
79   Clinton Street Social Club is billed as a cock...        3
83   High Class place? Not really sure but not my t...        2
84   Hands down the WORST service I have ever encou...        1
87   This place is ridiculously overpriced with ter...        1
91   We love this place normally - great atmosphere...        3
96   I'm not originally from the Iowa City area and...        1
102  Good food, nice ambiance. The menu had a very ...        3
103  Overview: Clinton Street Social Club is a spea...        3
105  My two adult sons and I were very underwhelmed...        2
109  sucks. eaten here twice, food was terribly dis...        1
114  I went here for lunch with a group of six. We ...        2
117  I will never be back is the proper way to star...        1
127  The food was not good and service was not frie...        2
129  Great building. Loved the big windows overlook...        2
131  Dinner and cocktails on a Friday night. Place ...        2

In [23]:
df[(df.ratings <= 2) | (df.reviews.apply(len) < 100)]  # Disjuction

                                               reviews  ratings
13   Two stars. Go for the cocktails. The cheese cu...        2
28   My husband and I used to live in Iowa City but...        1
33   Great selection of drinks and cheese curds are...        5
59   It's the fourth time we come here. Usually the...        2
82   Had a great time this evening.  the experience...        5
83   High Class place? Not really sure but not my t...        2
84   Hands down the WORST service I have ever encou...        1
87   This place is ridiculously overpriced with ter...        1
96   I'm not originally from the Iowa City area and...        1
98   Great food, great drinks, great staff. This pl...        4
105  My two adult sons and I were very underwhelmed...        2
106  Fun place in downtown iowa city.  Good food, G...        4
109  sucks. eaten here twice, food was terribly dis...        1
114  I went here for lunch with a group of six. We ...        2
117  I will never be back is the proper way to star...        1
122              Half priced beer happy hours woo hoo!        5
124  I love the place. Great music, great bar, awes...        4
127  The food was not good and service was not frie...        2
129  Great building. Loved the big windows overlook...        2
131  Dinner and cocktails on a Friday night. Place ...        2

In [24]:
df[(df.ratings <= 2) & (df.reviews.apply(len) < 100)]  # Conjuction

                                               reviews  ratings
127  The food was not good and service was not frie...        2

In [25]:
df[df.ratings == 1]      # Use double equalities for exact matching

                                               reviews  ratings
28   My husband and I used to live in Iowa City but...        1
84   Hands down the WORST service I have ever encou...        1
87   This place is ridiculously overpriced with ter...        1
96   I'm not originally from the Iowa City area and...        1
109  sucks. eaten here twice, food was terribly dis...        1
117  I will never be back is the proper way to star...        1

In [26]:
df[df["reviews"].str.contains("service")]        # Find all reviews that mention "service"

                                               reviews  ratings
1    This was an exceptional surprise in Iowa city!...        5
13   Two stars. Go for the cocktails. The cheese cu...        2
21   I dug this bar.  It's a little on the pretenti...        4
26   Hands down, one of my favorite places to eat i...        5
27   Went here tonight my birthday with friends. We...        5
28   My husband and I used to live in Iowa City but...        1
32   Such a fun semi-swanky bar! It's speakeasy sty...        5
42   This is by far my favorite place to grab a dri...        5
44   An awesome place with great atmosphere! The ha...        5
48   This is definitely one of my favorite bars in ...        5
69   If you're looking for places that aren't riddl...        4
84   Hands down the WORST service I have ever encou...        1
86   Went here for a happy hour and was very please...        4
87   This place is ridiculously overpriced with ter...        1
88   Great food...good music..Great service.\r\nThe...        4
97   What a fantastic replacement for the not so gr...        5
99   My friend and I are new to town and we went to...        5
110  I'm so glad Clinton Street is in Iowa City. Th...        5
112  This place gets better each time I go. The fir...        4
115  I have eaten here twice while visiting Iowa Ci...        4
117  I will never be back is the proper way to star...        1
127  The food was not good and service was not frie...        2
129  Great building. Loved the big windows overlook...        2
130  Love the food, love the service. If you are in...        5

The codes above will not change the original dataframe and will not create new dataframe.

To actually create a new dataframe, you need to use <b>.copy()</b> method and assign the output to a new variable.

In [27]:
dftemp = df[df["reviews"].str.contains("service")].copy()
dftemp.head()

                                              reviews  ratings
1   This was an exceptional surprise in Iowa city!...        5
13  Two stars. Go for the cocktails. The cheese cu...        2
21  I dug this bar.  It's a little on the pretenti...        4
26  Hands down, one of my favorite places to eat i...        5
27  Went here tonight my birthday with friends. We...        5

## Sort a Dataframe by Row Index or Columns

In [28]:
df.sort_index(ascending=False, inplace=True) 
df.head()

                                               reviews  ratings
131  Dinner and cocktails on a Friday night. Place ...        2
130  Love the food, love the service. If you are in...        5
129  Great building. Loved the big windows overlook...        2
128  Wow have times changed in downtown Iowa City. ...        4
127  The food was not good and service was not frie...        2

Here, we sort df by its row index in descending order.

In [29]:
df.sort_values(by='ratings', ascending=True, inplace=True)
df.head()

                                               reviews  ratings
109  sucks. eaten here twice, food was terribly dis...        1
96   I'm not originally from the Iowa City area and...        1
28   My husband and I used to live in Iowa City but...        1
117  I will never be back is the proper way to star...        1
87   This place is ridiculously overpriced with ter...        1

Here, we sort df by ratings in ascending order.

## Reset the Index of Dataframe

After sorting, cleaning and selecting data, the rows in the new dataframe are still indexed as in the original dataframe, which may cause confusion when you select data in the new dataframe.

In [30]:
df.ratings[0]

5

Although we have sorted df, it will return the row indexed by 0 in the original unsorted dataframe instead of the first row in the sorted df.

We may want to reset the row index of the new dataframe so that you can properly select data in the new dataframe using row index.

In [31]:
df.reset_index(inplace=True, drop=True)
df.head()

                                             reviews  ratings
0  sucks. eaten here twice, food was terribly dis...        1
1  I'm not originally from the Iowa City area and...        1
2  My husband and I used to live in Iowa City but...        1
3  I will never be back is the proper way to star...        1
4  This place is ridiculously overpriced with ter...        1

Use <b>drop</b> to not to keep the original index in the dataframe as a new column.

In the example above, we do **df.sort_values** first and then use **df.reset_index** to reset the index. However, we can set **ignore_index=True** inside **df.sort_values** so that the row indexes will be automatically reset after sorting. This way, we will no longer need to do **df.reset_index**. See this example:

In [32]:
df.sort_values(by='ratings', ascending=True, inplace=True, ignore_index=True)
df.head()

                                             reviews  ratings
0  sucks. eaten here twice, food was terribly dis...        1
1  I'm not originally from the Iowa City area and...        1
2  My husband and I used to live in Iowa City but...        1
3  I will never be back is the proper way to star...        1
4  This place is ridiculously overpriced with ter...        1

However, knowing how to use **df.reset_index** is still important because you can still use it to reset the row indexes when you are not sorting the rows. For example, deleting rows will also cause discontinuous indexes and resetting may be needed.